
## Plan Result




<pre><code>Plan: 8 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_storage_blob.b2c_copyright_png
  * azurerm_storage_blob.b2c_favicon
  * azurerm_storage_blob.b2c_login_css
  * azurerm_storage_blob.b2c_login_html
  * azurerm_storage_blob.b2c_logo_gov
  * azurerm_storage_blob.b2c_mfa_css
  * azurerm_storage_blob.b2c_mfa_html
  * azurerm_storage_container.pre_b2c_container


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.b2c_copyright_png will be created
  + resource "azurerm_storage_blob" "b2c_copyright_png" {
      + access_tier            = (known after apply)
      + content_md5            = "ba68e29f2b8d6c98bbe820e2bf565ad2"
      + content_type           = "image/x-png"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "copyright.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/copyright.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_favicon will be created
  + resource "azurerm_storage_blob" "b2c_favicon" {
      + access_tier            = (known after apply)
      + content_md5            = "de7abc5226925203ac10b0a4a94af949"
      + content_type           = "image/x-icon"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "favicon.ico"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/favicon.ico"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_login_css will be created
  + resource "azurerm_storage_blob" "b2c_login_css" {
      + access_tier            = (known after apply)
      + content_md5            = "f9883e1455fbb50d4737b194909ee05f"
      + content_type           = "text/css"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "login.css"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/login.css"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_login_html will be created
  + resource "azurerm_storage_blob" "b2c_login_html" {
      + access_tier            = (known after apply)
      + content_md5            = "2d9dd23510b325ec54b12e22544e87c8"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "login.html"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/login.html"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_logo_gov will be created
  + resource "azurerm_storage_blob" "b2c_logo_gov" {
      + access_tier            = (known after apply)
      + content_md5            = "0c9e8639ea578c52504c066c5b805508"
      + content_type           = "image/x-png"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "logo_gov.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/logo_gov.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_mfa_css will be created
  + resource "azurerm_storage_blob" "b2c_mfa_css" {
      + access_tier            = (known after apply)
      + content_md5            = "4f23b1397bc211d0f5d3f4ca720c3901"
      + content_type           = "text/css"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "mfa.css"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/mfa.css"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_mfa_html will be created
  + resource "azurerm_storage_blob" "b2c_mfa_html" {
      + access_tier            = (known after apply)
      + content_md5            = "ad720484bf391450e55d8293e443e34f"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "mfa.html"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/mfa.html"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_container.pre_b2c_container will be created
  + resource "azurerm_storage_container" "pre_b2c_container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "pre-b2c-container"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "presastg"
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":714,"Program":"tfcmt","SHA1":"","Vars":{}} -->